Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.AnalyticalBeamSlabWarning Property
 Beam and Slab Analytical Models do not have the same Analytical Projection Plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId AnalyticalBeamSlabWarning { get; }
Public Shared ReadOnly Property AnalyticalBeamSlabWarning As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ AnalyticalBeamSlabWarning {
	FailureDefinitionId^ get ();
}
static member AnalyticalBeamSlabWarning : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace